// let obj = [{ name: 'zs' }]
// console.log(obj)
// let strObj = JSON.stringify(obj)
// console.log(strObj)
// let obj1 = JSON.parse(strObj)
// obj1[0].age = 18

// console.log(JSON.stringify(obj1))

const province = {
  name: ['张三', '李四'],
  province: [
    '河北省',
    '山西省',
    '辽宁省',
    '吉林省',
    '黑龙江省',
    '江苏省',
    '浙江省',
    '安徽省',
    '福建省',
    '江西省',
    '山东省',
    '河南省',
    '湖北省',
    '湖南省',
    '广东省',
    '海南省',
    '四川省',
    '贵州省',
    '云南省',
    '陕西省',
    '甘肃省',
    '青海省',
    '台湾省',
    '内蒙古自治区',
    '广西壮族自治区',
    '西藏自治区',
    '宁夏回族自治区',
    '新疆维吾尔自治区',
    '北京市',
    '天津市',
    '上海市',
    '重庆市',
    '香港特别行政区',
    '澳门特别行政区',
  ],
}
// const province = [
//   '河北省',
//   '山西省',
//   '辽宁省',
//   '吉林省',
//   '黑龙江省',
//   '江苏省',
//   '浙江省',
//   '安徽省',
//   '福建省',
//   '江西省',
//   '山东省',
//   '河南省',
//   '湖北省',
//   '湖南省',
//   '广东省',
//   '海南省',
//   '四川省',
//   '贵州省',
//   '云南省',
//   '陕西省',
//   '甘肃省',
//   '青海省',
//   '台湾省',
//   '内蒙古自治区',
//   '广西壮族自治区',
//   '西藏自治区',
//   '宁夏回族自治区',
//   '新疆维吾尔自治区',
//   '北京市',
//   '天津市',
//   '上海市',
//   '重庆市',
//   '香港特别行政区',
//   '澳门特别行政区',
// ]
// const arr1 = '香港特别行政区、澳门特别行政区'.split('、')
// console.log(arr1)
// province.forEach(i => console.log(i))
console.log(Object.keys(province))
console.log(Object.values(province))
